НВ_Доработки/Catalogs/НВД_Периоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НВД_Периоды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

НВ_Доработки/Catalogs/НВД_Периоды/Forms/ФормаЗаполненияПериодов/Ext/Form/Module.bsl
// Процедура устанавливает значения и доступность флагов заполнения
//
&НаСервере
Процедура ПриИзмененииРодителя(Отказ = Ложь)
	
	ПериодичностьРодителя = Родитель.Периодичность;
	
	//ЗаполнятьДевятьМесяцев = Ложь;
	ЗаполнятьПолугодия     = Ложь;
	ЗаполнятьКварталы      = Ложь;
	ЗаполнятьМесяцы        = Ложь;
	ЗаполнятьДекады        = Ложь;
	ЗаполнятьНедели        = Ложь;
	ЗаполнятьДни           = Ложь;

	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не определен период-родитель!";
		Сообщение.Сообщить();
		
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.День Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период с периодичностью ""День"" является минимальным!";
		Сообщение.Сообщить();

	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Год Тогда
		//ЗаполнятьДевятьМесяцев = Истина;
		ЗаполнятьПолугодия     = Истина;
		ЗаполнятьКварталы      = Истина;
		ЗаполнятьМесяцы        = Истина;
		ЗаполнятьДекады        = Истина;
		ЗаполнятьНедели        = Истина;
		ЗаполнятьДни           = Истина;
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.ДевятьМесяцев Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период девять месяцев не может содержать подчиненных периодов";
		Сообщение.Сообщить();

	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Полугодие Тогда
		ЗаполнятьКварталы  = Истина;
		ЗаполнятьМесяцы    = Истина;
		ЗаполнятьДекады    = Истина;
		ЗаполнятьНедели    = Истина;
		ЗаполнятьДни       = Истина;
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Квартал Тогда
		ЗаполнятьМесяцы    = Истина;
		ЗаполнятьДекады    = Истина;
		ЗаполнятьНедели    = Истина;
		ЗаполнятьДни       = Истина;
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Месяц Тогда
		ЗаполнятьНедели    = Истина;
		ЗаполнятьДекады    = Истина;
		ЗаполнятьДни       = Истина;
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Декада Тогда
		ЗаполнятьДни       = Истина;
	ИначеЕсли ПериодичностьРодителя = Перечисления.Периодичность.Неделя Тогда
		ЗаполнятьДни       = Истина;
	КонецЕсли;
	
	//Элементы.ЗаполнятьДевятьМесяцев.Доступность = ЗаполнятьДевятьМесяцев;
	Элементы.ЗаполнятьПолугодия.Доступность     = ЗаполнятьПолугодия;
	Элементы.ЗаполнятьКварталы.Доступность      = ЗаполнятьКварталы;
	Элементы.ЗаполнятьМесяцы.Доступность        = ЗаполнятьМесяцы;
	Элементы.ЗаполнятьДекады.Доступность        = ЗаполнятьДекады;
	Элементы.ЗаполнятьНедели.Доступность        = ЗаполнятьНедели;
	Элементы.ЗаполнятьДни.Доступность           = ЗаполнятьДни;
	
КонецПроцедуры

&НаСервере
Функция Вн_СоздатьПериоды()
	
	ЗаполняемыеПериоды = Новый Массив;
	
	//Если ЗаполнятьДевятьМесяцев Тогда
	//	ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.ДевятьМесяцев);
	//КонецЕсли;
	
	Если ЗаполнятьПолугодия Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.Полугодие);
	КонецЕсли;
	
	Если ЗаполнятьКварталы Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.Квартал);
	КонецЕсли;
	
	Если ЗаполнятьМесяцы Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.Месяц);
	КонецЕсли;
	
	Если ЗаполнятьНедели Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.Неделя);
	КонецЕсли;
	
	Если ЗаполнятьДекады Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.Декада);
	КонецЕсли;
	
	Если ЗаполнятьДни Тогда
		ЗаполняемыеПериоды.Добавить(Перечисления.Периодичность.День);
	КонецЕсли;
	
	Если ЗаполняемыеПериоды.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не отмечена ни одна периодичность!";
		Сообщение.Поле  = "Родитель";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	КонецЕсли;

	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не определен период-родитель!";
		Сообщение.Поле  = "Родитель";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	ИначеЕсли Родитель.Периодичность = Перечисления.Периодичность.День Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период с периодичностью ""День"" является минимальным!";
		Сообщение.Поле  = "Родитель";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	ИначеЕсли Родитель.Произвольный Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период-родитель является произвольным." + Символы.ПС + "Отсутствует возможность генерации произвольных периодов!";
		Сообщение.Поле  = "Родитель";
		Сообщение.Сообщить();
		Возврат Ложь;
		
	Иначе
		
		Если ЗаполняемыеПериоды.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Если Справочники.НВД_Периоды.СоздатьПериоды(Родитель, ЗаполняемыеПериоды) Тогда
			ЗафиксироватьТранзакцию();
			Возврат Истина;
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура СоздатьПериоды(Команда)
	
	Вн_СоздатьПериоды();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Родитель = Параметры.ПериодРодитель;
	ПриИзмененииРодителя(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ПриИзмененииРодителя();
	
КонецПроцедуры
